day04/01introToFVM/101FVM/pipe3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.x                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// block definition for a round tube along z-axis
//
                                    
convertToMeters 3.0e-3;

vertices
(
    // back region
    ( -0.2 0  0 )  // pt 0 (a1b) 
    ( 0 -0.2  0 )  // pt 1 (a2b) 
    ( 0.2 0  0 )  // pt 2 (a3b) 
    ( 0 0.2  0 )  // pt 3 (a4b) 
    ( -0.5 0  0 )  // pt 4 (a5b) 
    ( 0 -0.5  0 )  // pt 5 (a6b) 
    ( 0.5 0  0 )  // pt 6 (a7b) 
    ( 0 0.5  0 )  // pt 7 (a8b) 

    // middle region 1
    ( -0.2 0  24 )  // pt 8 (a1f)  
    ( 0 -0.2  24 )  // pt 9 (a2f) 
    ( 0.2 0  24 )  // pt 10 (a3f) 
    ( 0 0.2  24 )  // pt 11 (a4f) 
    ( -0.5 0  24 )  // pt 12 (a5f) 
    ( 0 -0.5  24 )  // pt 13 (a6f) 
    ( 0.5 0  24 )  // pt 14 (a7f) 
    ( 0 0.5  24 )  // pt 15 (a8f) 

    // middle region 2
    ( -0.2 0  48 )  // pt 16 (ia1f)  
    ( 0 -0.2  48 )  // pt 17 (ia2f) 
    ( 0.2 0  48 )  // pt 18 (ia3f) 
    ( 0 0.2  48 )  // pt 19 (ia4f) 
    ( -0.5 0  48 )  // pt 20 (ia5f) 
    ( 0 -0.5  48 )  // pt 21 (ia6f) 
    ( 0.5 0  48 )  // pt 22 (ia7f) 
    ( 0 0.5  48 )  // pt 23 (ia8f) 

    // front region
    ( -0.2 0  72 )  // pt 24 (ja1f) 
    ( 0 -0.2  72 )  // pt 25 (ja2f) 
    ( 0.2 0  72 )  // pt 26 (ja3f) 
    ( 0 0.2  72 )  // pt 27 (ja4f) 
    ( -0.5 0  72 )  // pt 28 (ja5f) 
    ( 0 -0.5  72 )  // pt 29 (ja6f) 
    ( 0.5 0  72 )  // pt 30 (ja7f) 
    ( 0 0.5  72 )  // pt 31 (ja8f) 
);

blocks
(
    // back block
    hex (0 1 2 3 8 9 10 11)
    inlet ( 8 8 24 ) simpleGrading (1 1 1)

    // back side block
    hex (1 0 4 5 9 8 12 13)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (2 1 5 6 10 9 13 14)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (3 2 6 7 11 10 14 15)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (0 3 7 4 8 11 15 12)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)

    // middle block
    hex (8 9 10 11 16 17 18 19)
    inlet ( 8 8 24 ) simpleGrading (1 1 1)

    // middle side block
    hex (9 8 12 13 17 16 20 21)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (10 9 13 14 18 17 21 22)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (11 10 14 15 19 18 22 23)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (8 11 15 12 16 19 23 20)
    inlet ( 8 9 24 ) simpleGrading (1 .5 1)

    // front block
    hex (16 17 18 19 24 25 26 27)
    inlet ( 8 8 24 ) simpleGrading (1 1 1)

    // front side block
    hex (17 16 20 21 25 24 28 29)
    outlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (18 17 21 22 26 25 29 30)
    outlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (19 18 22 23 27 26 30 31)
    outlet ( 8 9 24 ) simpleGrading (1 .5 1)
    hex (16 19 23 20 24 27 31 28)
    outlet ( 8 9 24 ) simpleGrading (1 .5 1)
);

edges
(
    arc 4 5 (-0.3535533906 -0.3535533906 0)
    arc 5 6 (0.3535533906 -0.3535533906 0)
    arc 6 7 (0.3535533906 0.3535533906 0)
    arc 7 4 (-0.3535533906 0.3535533906 0)
    arc 12 13 (-0.3535533906 -0.3535533906 24)
    arc 13 14 (0.3535533906 -0.3535533906 24)
    arc 14 15 (0.3535533906 0.3535533906 24)
    arc 15 12 (-0.3535533906 0.3535533906 24)
    arc 20 21 (-0.3535533906 -0.3535533906 48)
    arc 21 22 (0.3535533906 -0.3535533906 48)
    arc 22 23 (0.3535533906 0.3535533906 48)
    arc 23 20 (-0.3535533906 0.3535533906 48)
    arc 28 29 (-0.3535533906 -0.3535533906 72)
    arc 29 30 (0.3535533906 -0.3535533906 72)
    arc 30 31 (0.3535533906 0.3535533906 72)
    arc 31 28 (-0.3535533906 0.3535533906 72)
);

patches
(
    patch inlet 
    (
    (3 2 1 0)
    (1 5 4 0)
    (2 6 5 1)
    (3 7 6 2)
    (0 4 7 3)
    )
    wall walls 
    (
    (4 5 13 12)
    (5 6 14 13)
    (6 7 15 14)
    (7 4 12 15)
    (12 13 21 20)
    (13 14 22 21)
    (14 15 23 22)
    (15 12 20 23)
    (20 21 29 28)
    (21 22 30 29)
    (22 23 31 30)
    (23 20 28 31)
    )
    patch outlet 
    (
    (24 25 26 27)
    (24 28 29 25)
    (25 29 30 26)
    (26 30 31 27)
    (27 31 28 24)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
